In [1]:
from  school.student import Student
from school.course import SchoolCourse
from school.student_course import StudentInCourse
from school.student import SchoolStudent
from school.grade import Grade

<h1 style="text-align:center">
Create Students
</h1>

In [2]:
SchoolStudent.student(first_name = 'Arturo',
                        family_name = 'Camacho',
                        credit_capacity = 10)

New student added

True

In [3]:
SchoolStudent.student(first_name = 'Abel',
                        family_name = 'Camacho',
                        credit_capacity = 8)

New student added

True

In [4]:
SchoolStudent.student(first_name = 'Ivana',
                        family_name = 'Simeunovic',
                        credit_capacity = 8)

New student added

True

In [5]:
SchoolStudent.student(first_name = 'Elvis',
                        family_name = 'Presley',
                        credit_capacity = 8)

New student added

True

<h1 style="text-align:center">
Update Student
</h1>

In [6]:
SchoolStudent.student(first_name = 'Arturo',
                        family_name = 'Camacho Guardian',
                        credit_capacity = 10,
                                student_id = 2)

In [ ]:
SchoolStudent.student(first_name = 'Abel',
                        family_name = 'Camacho',
                        credit_capacity = 10,
                                student_id = 1)

<h1 style="text-align:center">
Remove Student
</h1>

In [ ]:
SchoolStudent.student_information(student_id = 2,
                                            student_information = 'student average')

<h1 style="text-align:center">
Create Course
</h1>

In [2]:
SchoolCourse.course(course_name = 'Dummy Course',
                     start_date = '2000-01-01',
                     end_date = '2000-01-01',
                     credit = 3,
                     capacity =10)

Course added

In [3]:
SchoolCourse.course(course_name = 'Linear Algebra I',
                     start_date = '2021-01-15',
                     end_date = '2021-01-20',
                     credit = 3,
                     capacity =10)

Course added

In [4]:
SchoolCourse.course(course_name = 'Linear Algebra II',
                     start_date = '2021-01-15',
                     end_date = '2021-01-20',
                     credit = 3,
                     capacity =3)

Course added

In [5]:
SchoolCourse.course(course_name = 'Calculus I',
                     start_date = '2021-02-01',
                     end_date = '2021-02-15',
                     credit = 3,
                     capacity =10)

Course added

<h1 style="text-align:center">
Add schedules
</h1>

<h1 style = "text-align:center">
Add student to course 
</h1>

In [6]:
new_student_in_course = SchoolCourse()
new_student_in_course.student_to_course(student_id = 1,
                                        course_id = 1)

In [7]:
new_student_in_course = SchoolCourse()
new_student_in_course.student_to_course(student_id = 1,
                                        course_id = 2)

In [8]:
new_student_in_course = SchoolCourse()
new_student_in_course.student_to_course(student_id = 1,
                                        course_id = 3)

In [9]:
new_student_in_course = SchoolCourse()
new_student_in_course.student_to_course(student_id = 2,
                                        course_id = 3)

In [10]:
new_student_in_course = SchoolCourse()
new_student_in_course.student_to_course(student_id = 3,
                                        course_id = 3)

<h1 style = "text-align:center">
Give student a grade
</h1>

In [11]:
add_grade = Grade(course_id = 1)
add_grade.add(student_id = 1,
              grade = 'A')

In [12]:
add_grade = Grade(course_id = 2)
add_grade.add(student_id = 1,
              grade = 'B')

In [13]:
add_grade = Grade(course_id = 3)
add_grade.add(student_id = 1,
              grade = 'B')

In [14]:
add_grade = Grade(course_id = 3)
add_grade.add(student_id = 2,
              grade = 'F')

In [15]:
add_grade = Grade(course_id = 3)
add_grade.add(student_id = 3,
              grade = 'A')

<h1 style = "text-align:center">
Get Student course information
</h1>

In [16]:
SchoolStudent.student_information(student_id = 1, 
                                 student_information = 'all courses')

   StudentId FirstName FamilyName         CourseName
0          1    Arturo    Camacho       Dummy Course
1          1    Arturo    Camacho   Linear Algebra I
2          1    Arturo    Camacho  Linear Algebra II

In [17]:
SchoolStudent.student_information(student_id = 2, 
                                 student_information = 'all courses')

   StudentId FirstName FamilyName         CourseName
0          2      Abel    Camacho  Linear Algebra II

In [18]:
SchoolStudent.student_information(student_id = 3, 
                                 student_information = 'all courses')

   StudentId FirstName  FamilyName         CourseName
0          3     Ivana  Simeunovic  Linear Algebra II

In [19]:
SchoolStudent.student_information(student_id = 2,
                                         course_id = 3,
                                            student_information = 'course grade')

  FirstName FamilyName Grade         CourseName
0      Abel    Camacho     B  Linear Algebra II
1      Abel    Camacho     F  Linear Algebra II

In [20]:
SchoolStudent.student_information(student_id = 2,
                                         course_id = 1,
                                            student_information = 'course grade')

  FirstName FamilyName Grade    CourseName
0      Abel    Camacho     A  Dummy Course
1      Abel    Camacho     B  Dummy Course

In [24]:
SchoolStudent.student_information(student_id = 1,
                                            student_information = 'student average')

  FirstName FamilyName  AverageGrade
0    Arturo    Camacho      4.294118

In [23]:
SchoolStudent.student_information(student_id = 2,
                                            student_information = 'student average')

  FirstName FamilyName  AverageGrade
0      Abel    Camacho           3.0

In [25]:
SchoolStudent.student_information(student_id = 3,
                                            student_information = 'student average')

  FirstName  FamilyName  AverageGrade
0     Ivana  Simeunovic           4.8